{
  "backend/main.mo": "Main Motoko actor for the student marketplace app, defining types and shared state for marketplace listings, service listings, user profiles, ratings, meetup intents, notifications, and past papers, along with query/update methods protected by access control.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file, describing their purpose and key implementation details for build planning reference.",
  "frontend/index.css": "Root CSS file that sets up Tailwind base/components/utilities and defines OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, primary, chart, and sidebar colors.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React app into a `#root` div and loads the TypeScript module entry point `src/main.tsx`.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all app routes (marketplace, services, admin, profile, meetup, papers), wraps the app in QueryClientProvider and ThemeProvider, and includes a top-level ErrorBoundary.",
  "frontend/src/components/EditMarketplaceListingModal.tsx": "Dialog modal for editing an existing marketplace listing, supporting file uploads up to 10 GB with progress tracking, actor readiness checks, and form validation for title, price, subject, class year, and contact fields.",
  "frontend/src/components/EditServiceListingModal.tsx": "Dialog modal for editing a service listing with fields for category, description, helper name, and WhatsApp number, including inline validation and a mutation call to update the listing.",
  "frontend/src/components/FileTypeIcon.tsx": "Renders a colored icon and badge label for a given MIME type, categorizing files as Video, PDF, Image, Spreadsheet, Slides, Document, or generic File.",
  "frontend/src/components/Layout.tsx": "Main app layout component providing a sticky header with navigation links, login/logout controls via Internet Identity, and a profile setup modal trigger for new users.",
  "frontend/src/components/LocationShareButton.tsx": "Button component that uses the browser Geolocation API to capture the user's coordinates, displays a static map preview on success, and allows resetting the selection.",
  "frontend/src/components/NotificationBell.tsx": "Bell icon button that shows an unread notification count badge and opens a popover listing recent notifications, tracking read state via sessionStorage.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts new authenticated users to enter a display name and optional WhatsApp number, saving the profile via a mutation on submission.",
  "frontend/src/components/RatingDisplay.tsx": "Displays a star rating summary (average and count) for a given listing ID, fetched via a query hook.",
  "frontend/src/components/RatingModal.tsx": "Dialog that lets authenticated users submit a 1–5 star rating with an optional comment for a specific listing, using an interactive star picker.",
  "frontend/src/components/ShareVideoButton.tsx": "Button that copies a shareable URL for a video listing or paper to the clipboard; only renders when the provided MIME type is a video.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks (queries and mutations) for interacting with the backend actor, covering user profiles, marketplace listings, service listings, and related CRUD operations.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind CSS layers, defines CSS custom properties for a blue-purple themed design system (light and dark modes), and adds utility classes for gradients and hover effects.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider into the DOM root.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page that displays all marketplace and service listings in a tabbed interface, allowing admins to soft-delete listings with confirmation dialogs.",
  "frontend/src/pages/CreateMarketplaceListingPage.tsx": "Form page for authenticated users to create a new marketplace listing, supporting file uploads (images, videos, documents up to 10GB) with progress tracking and field validation.",
  "frontend/src/pages/CreateServiceListingPage.tsx": "A form page that allows authenticated users to create a new service listing by filling in their name, category, description, and WhatsApp contact, then submitting it via a mutation hook.",
  "frontend/src/pages/HomePage.tsx": "The landing page featuring a hero section, category cards linking to the Marketplace and Services pages, and trust/feature highlights for the student marketplace platform.",
  "frontend/src/pages/MarketplaceListingsPage.tsx": "Displays active marketplace listings with search and category filtering, and allows authenticated users to mark items as purchased, arrange meetups, and rate transactions.",
  "frontend/src/pages/MeetupTrackerPage.tsx": "Shows the meetup details for a specific marketplace listing, rendering a static map from coordinates stored in the meetup note and allowing participants to confirm the exchange.",
  "frontend/src/pages/PapersListingPage.tsx": "Lists uploaded academic papers with search and filtering, and lets authenticated users download files (including video previews) with correct filenames via a utility helper.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the authenticated user's profile with editable fields (display name, WhatsApp, bio) and tabbed views for their marketplace listings, service listings, and uploaded papers, with delete and download actions for each.",
  "frontend/src/pages/ServiceListingsPage.tsx": "Lists active service listings with search, category filter, and sort controls, and allows logged-in users to navigate to create a new service listing.",
  "frontend/src/pages/UploadPaperPage.tsx": "Provides a form for authenticated users to upload previous-year papers (supporting large files up to 10GB across many formats) with chunked upload progress tracking.",
  "frontend/src/utils/featureRegistry.ts": "A static checkpoint/reference document that enumerates all routes, page components, shared components, hooks, and backend functions used by the frontend to prevent accidental removal.",
  "frontend/src/utils/fileDownload.ts": "Provides utilities to map MIME types to file extensions, construct sanitized download filenames, and trigger file downloads by fetching bytes and creating a blob URL.",
  "frontend/src/utils/timeAgo.ts": "Converts an Internet Computer nanosecond timestamp (bigint or number) into a human-readable relative time string such as '5 minutes ago'.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear those parameters using sessionStorage and history.replaceState.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme tokens (colors via OKLCH variables, fonts, border radii, shadows, keyframes) and enabling the typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata for the Student Marketplace Hub, recording a single pending feature request (AR-1) to deploy the backend and frontend to the Internet Computer mainnet."
}